#include "nr3.h"

void caldat(const int julian, int& mm, int& id, int& iyyy) {
    const int IGREG=2299161;
    int ja,jalpha,jb,jc,jd,je;
    if (julian >= IGREG) {
    jalpha=int((Doub(julian-1867216)-0.25)/36524.25);
    ja=julian+1+jalpha-int(0.25*jalpha);
    } else if (julian < 0) {
    ja=julian+36525*(1-julian/36525);
    } else
        ja=julian;
    jb=ja+1524;
    jc=int(6680.0+(Doub(jb-2439870)-122.1)/365.25);
    jd=int(365*jc+(0.25*jc));
    je=int((jb-jd)/30.6001);
    id=jb-jd-int(30.6001*je);
    mm=je-1;
    if (mm > 12) mm -= 12;
    iyyy=jc-4715;
    if (mm > 2) --iyyy;
    if (iyyy <= 0) --iyyy;
    if (julian < 0) iyyy -= 100*(1-julian/36525);
}

// const Int julian — БЕЗ ссылки (Входной параметр)

// Здесь передается значение по копии.
// Что происходит: Когда вы вызываете функцию, компилятор создает временную копию переменной julian. Внутри функции вы можете делать с ней что угодно, но оригинальная переменная в вызывающем коде останется нетронутой.
// Зачем const? Слово const здесь защищает от случайного изменения копии внутри самой функции. (Примечание: для простых типов вроде int const при передаче по значению часто опускают, но в серьезных библиотеках его ставят для строгости).
// Когда так делать: Для простых типов (int, double, float, char, bool), которые являются только входными данными.

// когда пишем const Int julian, то оберегаем julian, от случайных изменений внутри функции,
// но здесь такой ситуации не произошло, поэтому это чисто как защита от ошибок

// Глядя на сигнатуру:
// void caldat(const Int julian, Int &mm, Int &id, Int &iyyy)
// Вы мгновенно, не читая тело функции, понимаете архитектуру:
// julian — это вход (мы его отдаем, он не меняется).
// mm, id, iyyy — это выходы (они с &, значит функция их заполнит).
// Если бы const не было, вам пришлось бы пробегать глазами весь код, чтобы убедиться, что julian нигде не модифицируется.